<html>
  <body  bgcolor="black">
  <font size=+2 color=white><B>
  <marquee direction="up" scrolldelay=150  width=100% height=100% >
    <p>2004-6-15日<p>
    <li>所有界面中单元格的线条变细了，界面更加细腻。</li>
    <li>学生模块选课手工测试通过了。</li>
    <li>教学任务生成可以指定教室要求，节此、周数和起始周。</li>
    <p>2004-6-7日<p>
    <li>评教模块初步通过学生测试了。</li>
    <li>忘记的密码可以发送回邮箱了，用户可以在修改密码的界面中确认自己的邮箱设置，以确保正确</li>
    <li>选课筛选模块可以指定学生了。</li>
    <li>选课范围模块可以批量初始化了。</li>
    <li>双专业录取功能测试通过了。</li>
    <li>成绩模块通过初步测试了。</li>
    <p>2004-5-24日<p>
    <li>为系统管理员增加了限制在线用户数量的功能位置在[系统管理->权限管理->在线用户]</li>
    <p>2004-5-12日<p>
    <li>登录欢迎界面中能显示学生和老师的姓名</li>
    <li>重复登录和用户禁用 等信息可以在登录时提示</li>
    <p>2004-5-7日<p>
    <li>在页面跳转中，支持了指定页长的功能</li>
    <li>增加了一次添加多个教学任务的功能（模块任选可以只添加一次）</li>  
    <li>增加了院系在填报排课建议的功能</li>
    <p>2004-4-29日<p>
    <li>在排考结果模块添加了删除排考结果功能</li>  
    <p>2004-4-25日<p>
    <li>增加了登录界面的双语选择</li>
    <li>纠正了学生在校日历不能添加的错误</li>
    <p>2004-4-24日<p>
    <li>增加了登录欢迎界面</li>
    <li>增加了用户管理中的在线状态观察</li>
    <p>2004-4-23日</p>
    <li>改进了对培养计划多个院系和学生类别的查询。</li>
    <li>修正了对教学日历新增错误的</li>
    <li>修正了对生成的培养计划进行修改时，引起的错误</li>
    <li>支持男女生分班</li>
    <li>支持学号单双号分班</li>
  </marquee></B>
  </font>
  </body>
</html>